# Explain

The **SQL LEFT JOIN** returns all rows from the left table, even if there are no matches in the right table. This means that if the **ON** clause matches 0 (zero) records in the right table; the join will still return a row in the result, but with **NULL** in each column from the right table.

This means that a left join returns all the values from the left table, plus matched values from the right table or NULL in case of no matching join predicate.

Syntax
The basic syntax of a **LEFT JOIN** is as follows.

```sql
SELECT table1.column1, table2.column2...
FROM table1
LEFT JOIN table2
ON table1.common_field = table2.common_field;
```

![](../images/left-join-trong-sql.png)

# Example

## create db

In [13]:
%%bash
../scripts/create_db_server.sh

my-postgresql
35f31c77eae7632fe49fd61d6d2f46a6b8e68bc93f31464975d70d48365c4cfa

Connection to localhost 5432 port [tcp/postgresql] succeeded!

Created db server

## load sql extension and connect db

In [14]:
%load_ext sql
%sql postgresql://postgres:password123@localhost/dvdrental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## create CUSTOMERS table

In [15]:
%%sql

CREATE TABLE IF NOT EXISTS CUSTOMERS (
   ID   INT              NOT NULL,
   NAME VARCHAR (20)     NOT NULL,
   AGE  INT              NOT NULL,
   ADDRESS  CHAR (25),
   SALARY   DECIMAL (18, 2),
   PRIMARY KEY (ID)
);

INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (1, 'Ha Anh', 32, 'Da Nang', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (2, 'Van Ha', 25, 'Ha Noi', 1500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (3, 'Vu Bang', 23, 'Vinh', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (4, 'Thu Minh', 25, 'Ha Noi', 6500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'Hai An', 27, 'Ha Noi', 8500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'Hoang', 22, 'Ha Noi', 4500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (7, 'Binh', 24, 'Ha Noi', 10000.00 ) ON CONFLICT DO NOTHING;

SELECT * FROM CUSTOMERS;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 'Ha Anh', 32, 'Da Nang                  ', Decimal('2000.00')),
 (2, 'Van Ha', 25, 'Ha Noi                   ', Decimal('1500.00')),
 (3, 'Vu Bang', 23, 'Vinh                     ', Decimal('2000.00')),
 (4, 'Thu Minh', 25, 'Ha Noi                   ', Decimal('6500.00')),
 (5, 'Hai An', 27, 'Ha Noi                   ', Decimal('8500.00')),
 (6, 'Hoang', 22, 'Ha Noi                   ', Decimal('4500.00')),
 (7, 'Binh', 24, 'Ha Noi                   ', Decimal('10000.00'))]

## create ORDERS table

In [16]:
%%sql

CREATE TABLE IF NOT EXISTS ORDERS (
   OID  INT              NOT NULL,
   DATE VARCHAR (20)     NOT NULL,
   CUSTOMER_ID INT       NOT NULL,
   AMOUNT INT,
   PRIMARY KEY (OID)
);

INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (102, '2009-10-08 00:00:00', 3, 10) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (100, '2009-10-08 00:00:00', 3, 15) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (101, '2009-11-20 00:00:00', 2, 5) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (103, '2008-05-20 00:00:00', 4, 20) ON CONFLICT DO NOTHING;

SELECT CUSTOMER_ID, AMOUNT, DATE
FROM ORDERS
ORDER BY CUSTOMER_ID;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[(2, 5, '2009-11-20 00:00:00'),
 (3, 10, '2009-10-08 00:00:00'),
 (3, 15, '2009-10-08 00:00:00'),
 (4, 20, '2008-05-20 00:00:00')]

## do LEFT JOIN

In [19]:
%%sql

SELECT  left_table.ID, left_table.NAME, right_table.AMOUNT, right_table.DATE
   FROM CUSTOMERS left_table
   LEFT JOIN ORDERS right_table
   ON left_table.ID = right_table.CUSTOMER_ID

-- SELECT  ID, NAME, AMOUNT, DATE
--    FROM CUSTOMERS
--    LEFT JOIN ORDERS
--    ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;

 * postgresql://postgres:***@localhost/dvdrental
8 rows affected.

[(3, 'Vu Bang', 10, '2009-10-08 00:00:00'),
 (3, 'Vu Bang', 15, '2009-10-08 00:00:00'),
 (2, 'Van Ha', 5, '2009-11-20 00:00:00'),
 (4, 'Thu Minh', 20, '2008-05-20 00:00:00'),
 (5, 'Hai An', None, None),
 (6, 'Hoang', None, None),
 (1, 'Ha Anh', None, None),
 (7, 'Binh', None, None)]